<table align="center" width=100%>
    <tr>
        <td width="20%">
            <img src="in-class.png">
        </td>
        <td>
            <div align="center">
                <font color="#21618C" size=8px>
                    <b> Inclass - Lab <br>(Day 2)
                    </b>
                </font>
            </div>
        </td>
        <td width="25%">
            <img src="GL-2.png">
        </td>
    </tr>
</table>

## Table of Content
1. **[Data Structures with Examples](#Data_Structures)**
2. **[Create and Manipulate the DataFrames](#create_manipulate)**

### Let's begin with some hands-on practice exercises

<a id='Data_Structures'></a>
## 1. Data Structures with Examples:

In [3]:
import pandas as pd

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>1. Write a program to create a dataframe from list of lists
</b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below nested list:**<br>

        data = [['Joy', 21], ['Mia', 15], ['Sam', 14]]

In [2]:
# type your code here
data = [['Joy', 21], ['Mia', 15], ['Sam', 14]]
pd.DataFrame(data)

     0   1
0  Joy  21
1  Mia  15
2  Sam  14

In [6]:
d = [['Joy', 21], ['Mia', 15], ['Sam', 14]]
pd.DataFrame(d)

     0   1
0  Joy  21
1  Mia  15
2  Sam  14

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>2. Extract the second word from the given string
</b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below string:**<br>
    
    sentence = 'Be confident and be yourself'

In [7]:
# type your code here
s= 'Be confident and be yourself'
s.split()[1]

'confident'

In [7]:
s1='Be confident and be yourself'
s1.split()[1]

'confident'

<a id='create_manipulate'></a>
## 2. Create and Manipulate the DataFrames:

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>3. Split the 'Name' column into two separate columns as First_Name and Last_Name </b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**

<table>
<tr>
<th>Name</th>
<th>Salary</th>
</tr>
<tr>
<td>Emma Larter</td>
<td>3200</td>
</tr>
<tr>
<td>Mia Junior</td>
<td>4500</td>
</tr>
<tr>
<td>Sophia Depp</td>
<td>3600</td>
</tr>
<tr>
<td>James Smith</td>
<td>5596</td>
</tr>
   
</table>

In [11]:
# type your code here
d1=pd.DataFrame({'Name':['Emma Larter','Mia Junior','Sophia Depp','James Smith'],
                 'Salary':[3200,4500,3600,5596]})
d1[['FirstName','LastName']]=d1['Name'].str.split(expand=True)
d1

          Name  Salary FirstName LastName
0  Emma Larter    3200      Emma   Larter
1   Mia Junior    4500       Mia   Junior
2  Sophia Depp    3600    Sophia     Depp
3  James Smith    5596     James    Smith

In [8]:
d2=pd.DataFrame({'Name':['Emma Larter','Mia Junior','Sophia Depp','James Smith'],
                'Salary':[3200,4500,3600,5596]})
d2[['FirstName','LastName']]=d2['Name'].str.split(expand=True)
d2

          Name  Salary FirstName LastName
0  Emma Larter    3200      Emma   Larter
1   Mia Junior    4500       Mia   Junior
2  Sophia Depp    3600    Sophia     Depp
3  James Smith    5596     James    Smith

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>4. Select the rows from below dataframe where marks are less than 60 </b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**

<table>
<tr>
<th>Name</th>
<th>Marks</th>
</tr>
<tr>
<td>John</td>
<td>90</td>
</tr>
<tr>
<td>Robert</td>
<td>50</td>
</tr>
<tr>
<td>Jonny</td>
<td>89</td>
</tr>
<tr>
<td>Mia</td>
<td>55</td>
</tr>
   
</table>

In [13]:
# type your code here
d2=pd.DataFrame({'Name':['John','Robert','Jonny','Mia'],
                 'Marks':[90,50,89,55]})
d2[d2['Marks']<60]

     Name  Marks
1  Robert     50
3     Mia     55

In [10]:
d2=pd.DataFrame({'Name':['John','Robert','Jonny','Mia'],
                'Marks':[90,50,89,55]})
d2[d2['Marks']<60]

     Name  Marks
1  Robert     50
3     Mia     55

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>5. Write a program to select the rows where the sales are higher than 60000 for Mumbai </b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**
   
<table>
<tr>
<th>Store</th>
<th>Location</th>
<th>Sales</th>
</tr>
<tr>
<td>A</td>
<td>Mumbai</td>
<td>40000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>45000</td>
</tr>
<tr>
<td>A</td>
<td>Hyderabad</td>
<td>50000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>90000</td>
</tr>
<tr>
<td>D</td>
<td>Pune</td>
<td>89000</td>
</tr>
<tr>
<td>A</td>
<td>Delhi</td>
<td>87000</td>
</tr>
<tr>
<td>D</td>
<td>Hyderabad</td>
<td>85000</td>
</tr>
<tr>
<td>A</td>
<td>Pune</td>
<td>78000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>89000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>70000</td>
</tr>
   
</table>

In [20]:
# type your code here
d3=pd.DataFrame({'Store':['A','B','A','C','D','A','D','A','C','B'],
                'Location':['Mumbai','Pune','Hyderabad','Mumbai','Pune','Delhi','Hyderabad','Pune','Mumbai','Pune'],
                'Sales':[40000,45000,50000,90000,89000,87000,85000,78000,89000,70000]})
d3[(d3.Sales>60000) & (d3.Location=='Mumbai')]

  Store Location  Sales
3     C   Mumbai  90000
8     C   Mumbai  89000

In [14]:
# type your code here
d3=pd.DataFrame({'Store':['A','B','A','C','D','A','D','A','C','B'],
                'Location':['Mumbai','Pune','Hyderabad','Mumbai','Pune','Delhi','Hyderabad','Pune','Mumbai','Pune'],
                'Sales':[40000,45000,50000,90000,89000,87000,85000,78000,89000,70000]})
d3[(d3.Sales>6000) & (d3.Location=='Mumbai')]

  Store Location  Sales
0     A   Mumbai  40000
3     C   Mumbai  90000
8     C   Mumbai  89000

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>6. Write a program to select stores located in Hyderabad</b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**
   
<table>
<tr>
<th>Store</th>
<th>Location</th>
<th>Sales</th>
</tr>
<tr>
<td>A</td>
<td>Mumbai</td>
<td>40000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>45000</td>
</tr>
<tr>
<td>A</td>
<td>Hyderabad</td>
<td>50000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>90000</td>
</tr>
<tr>
<td>D</td>
<td>Pune</td>
<td>89000</td>
</tr>
<tr>
<td>A</td>
<td>Delhi</td>
<td>87000</td>
</tr>
<tr>
<td>D</td>
<td>Hyderabad</td>
<td>85000</td>
</tr>
<tr>
<td>A</td>
<td>Pune</td>
<td>78000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>89000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>70000</td>
</tr>
   
</table>

In [16]:
# type your code here
d4=pd.DataFrame({'Store':['A','B','A','C','D','A','D','A','C','B'],
                'Location':['Mumbai','Pune','Hyderabad','Mumbai','Pune','Delhi','Hyderabad','Pune','Mumbai','Pune'],
                'Sales':[40000,45000,50000,90000,89000,87000,85000,78000,89000,70000]})
d4[d4['Location']=='Hyderabad']

  Store   Location  Sales
2     A  Hyderabad  50000
6     D  Hyderabad  85000

In [20]:
# type your code here
d4=pd.DataFrame({'Store':['A','B','A','C','D','A','D','A','C','B'],
                'Location':['Mumbai','Pune','Hyderabad','Mumbai','Pune','Delhi','Hyderabad','Pune','Mumbai','Pune'],
                'Sales':[40000,45000,50000,90000,89000,87000,85000,78000,89000,70000]})
d4[d4['Location']=='Hyderabad']

  Store   Location  Sales
2     A  Hyderabad  50000
6     D  Hyderabad  85000

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>7. Create a dataframe in pandas using the given list.
</b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below list**

        city = ['Delhi', 'Mumbai', 'Chennai', 'Kolkata']

In [18]:
# type your code here
city = ['Delhi', 'Mumbai', 'Chennai', 'Kolkata']
d5=pd.DataFrame(city)
d5

         0
0    Delhi
1   Mumbai
2  Chennai
3  Kolkata

In [21]:
city = ['Delhi', 'Mumbai', 'Chennai', 'Kolkata']
d5=pd.DataFrame(city)
d5

         0
0    Delhi
1   Mumbai
2  Chennai
3  Kolkata

In [28]:
pd.read_csv('car.csv')

    Make    Model  Year     Price
0   Tata  Harrier  2022  150000.0
1  honda     city  2020       8.0
2  honda    amaze  2021       7.5

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>8. Save a given dataframe to a csv file
</b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**
   
<table>
<tr>
<th>Store</th>
<th>Location</th>
<th>Sales</th>
</tr>
<tr>
<td>A</td>
<td>Mumbai</td>
<td>40000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>45000</td>
</tr>
<tr>
<td>A</td>
<td>Hyderabad</td>
<td>50000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>90000</td>
</tr>
<tr>
<td>D</td>
<td>Pune</td>
<td>89000</td>
</tr>
<tr>
<td>A</td>
<td>Delhi</td>
<td>87000</td>
</tr>
<tr>
<td>D</td>
<td>Hyderabad</td>
<td>85000</td>
</tr>
<tr>
<td>A</td>
<td>Pune</td>
<td>78000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>89000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>70000</td>
</tr>
   
</table>

In [31]:
# type your code here
d6=pd.read_csv('df_store.csv')
d6
d7.to_csv('city.csv')

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>9. Write a program to select all columns, except the 'Location' from the given dataframe
</b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**
   
<table>
<tr>
<th>Store</th>
<th>Location</th>
<th>Sales</th>
</tr>
<tr>
<td>A</td>
<td>Mumbai</td>
<td>40000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>45000</td>
</tr>
<tr>
<td>A</td>
<td>Hyderabad</td>
<td>50000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>90000</td>
</tr>
<tr>
<td>D</td>
<td>Pune</td>
<td>89000</td>
</tr>
<tr>
<td>A</td>
<td>Delhi</td>
<td>87000</td>
</tr>
<tr>
<td>D</td>
<td>Hyderabad</td>
<td>85000</td>
</tr>
<tr>
<td>A</td>
<td>Pune</td>
<td>78000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>89000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>70000</td>
</tr>
   
</table>

In [32]:
# type your code here
d8=pd.DataFrame({'Store':['A','B','A','C','D','A','D','A','C','B'],
                'Location':['Mumbai','Pune','Hyderabad','Mumbai','Pune','Delhi','Hyderabad','Pune','Mumbai','Pune'],
                'Sales':[40000,45000,50000,90000,89000,87000,85000,78000,89000,70000]})
d8.loc[:,['Store','Sales']]

  Store  Sales
0     A  40000
1     B  45000
2     A  50000
3     C  90000
4     D  89000
5     A  87000
6     D  85000
7     A  78000
8     C  89000
9     B  70000

In [22]:
d8=pd.DataFrame({'Store':['A','B','A','C','D','A','D','A','C','B'],
                'Location':['Mumbai','Pune','Hyderabad','Mumbai','Pune','Delhi','Hyderabad','Pune','Mumbai','Pune'],
                'Sales':[40000,45000,50000,90000,89000,87000,85000,78000,89000,70000]})
d8.loc[:,['Store','Sales']]

  Store  Sales
0     A  40000
1     B  45000
2     A  50000
3     C  90000
4     D  89000
5     A  87000
6     D  85000
7     A  78000
8     C  89000
9     B  70000

### 10. Write a program to insert a given column at the second position in a dataframe

**Use the dataframe given below:**

<table>
<tr>
<th>Name</th>
<th>Age</th>
</tr>
<tr>
<td>Emma Larter</td>
<td>34</td>
</tr>
<tr>
<td>Mia Junior</td>
<td>59</td>
</tr>
<tr>
<td>Sophia Depp</td>
<td>32</td>
</tr>
<tr>
<td>James Smith</td>
<td>40</td>
</tr>
   
</table>

**Add the variable 'Salary' as second column**<br>
            
            Salary = [35000, 24000, 55000, 40000]

In [37]:
# type your code here
d9=pd.DataFrame({'Name':['Emma Larter','Mia Junior','Sophia Depp','James Smith'],
                 'Age':[34,59,32,40]})
#d9['Salary']=[35000, 24000, 55000, 40000]
#d9
Salary = [35000, 24000, 55000, 40000]
d9.insert(1,'Salary',Salary)
d9

          Name  Salary  Age
0  Emma Larter   35000   34
1   Mia Junior   24000   59
2  Sophia Depp   55000   32
3  James Smith   40000   40

In [23]:
d9=pd.DataFrame({'Name':['Emma Larter','Mia Junior','Sophia Depp','James Smith'],
                 'Age':[34,59,32,40]})
salary=[35000,24000,55000,40000]
d9.insert(1,'Salary',salary)
d9

          Name  Salary  Age
0  Emma Larter   35000   34
1   Mia Junior   24000   59
2  Sophia Depp   55000   32
3  James Smith   40000   40

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>11. Write a program to get the third observation of the given dataframe
</b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**

<table>
<tr>
<th>Name</th>
<th>Age</th>
</tr>
<tr>
<td>Emma Larter</td>
<td>34</td>
</tr>
<tr>
<td>Mia Junior</td>
<td>59</td>
</tr>
<tr>
<td>Sophia Depp</td>
<td>32</td>
</tr>
<tr>
<td>James Smith</td>
<td>40</td>
</tr>
</table>

In [40]:
# type your code here
d10=pd.DataFrame({'Name':['Emma Larter','Mia Junior','Sophia Depp','James Smith'],
                 'Age':[34,59,32,40]})
d10.iloc[2,:]
d10.iloc[2:3]

          Name  Age
2  Sophia Depp   32

In [27]:
d10=pd.DataFrame({'Name':['Emma Larter','Mia Junior','Sophia Depp','James Smith'],
                 'Age':[34,59,32,40]})
d10.iloc[2:3]

          Name  Age
2  Sophia Depp   32

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>12. Write a program to create a dataframe from the provided lists</b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the following lists to create your arrays:**
        
            columns = ["Science", "Maths", "English"]
            
            marks = [[55, 78, 88], [93, 63, 83],[94, 74, 64]]
            
**Hint:** Convert the list marks into an array

In [42]:
# type your code here
col = ["Science", "Maths", "English"]
marks = [[55, 78, 88], [93, 63, 83],[94, 74, 64]]
pd.DataFrame(marks,columns=col)

   Science  Maths  English
0       55     78       88
1       93     63       83
2       94     74       64

In [28]:
columns = ["Science", "Maths", "English"]
marks = [[55, 78, 88], [93, 63, 83],[94, 74, 64]]
pd.DataFrame(marks,columns=columns)

   Science  Maths  English
0       55     78       88
1       93     63       83
2       94     74       64